// NMEC: 113278

# 0. Carregue o conteudo do ficheiro `/resouces/git_selection.csv`.
```sql
LOAD CSV WITH HEADERS FROM 'file:///resources/git_selection.csv' AS row
MERGE (employee: User {id:row.svn_id, name:row.real_name}) 
MERGE (project: Project {name:row.project_name}) 
MERGE (organization: Organization {name:trim(row.organization)}) 
MERGE (employee)-[:COMMITED {num:row.num, role_on_project:row.role_on_project}]->(project) 
MERGE (employee)-[:WORKS_ON]->(organization);
```

# 1. Liste a informação de cada utilizador.
```sql
MATCH (u:User) 
RETURN u.id AS User_ID, u.name AS User_Name;
```

# 2. Liste o nome de cada utilizador.
```sql
MATCH (u:User)
RETURN DISTINCT(u.name) AS User_Name;
```

# 3. Liste a informação de cada projeto, no qual tenha participado pelo menos um utilizador.
```sql
MATCH (u:User)-[:COMMITED]->(p:Project)
RETURN p.name AS Project_Name, COUNT(u) AS Number_Of_Users;
```

# 4. Liste os utilizadores e total de projetos em que cada um colabora.
```sql
MATCH (u:User)-[:COMMITED]->(p:Project)
RETURN u.name AS User_Name, COUNT(DISTINCT(p.name)) AS Number_Of_Projects;
```

# 5. Liste os utilizadores e do total de projetos em que cada colabora ordenados por ordem decrescente do total.
```sql
MATCH (u:User)-[:COMMITED]->(p:Project)
RETURN u.name AS User_Name, COUNT(DISTINCT(p.name)) AS Number_Of_Projects
ORDER BY Number_Of_Projects DESC;
```

# 6. Liste projetos e total de membros em cada projeto.
```sql
MATCH (u:User)-[:COMMITED]->(p:Project)
RETURN p.name AS Project_Name, COUNT(DISTINCT(u.name)) AS Number_Of_Users;
```

# 7. Liste projetos e total de membros com a role "Committer" em cada projeto.
```sql
MATCH (u:User)-[r:COMMITED]->(p:Project)
WHERE r.role_on_project = "Committer"
RETURN p.name AS Project_Name, COUNT(DISTINCT(u.name)) AS Number_Of_Committers, r.role_on_project AS Role;
```

# 8. Liste todos os utilizadores que participaram nos mesmo projetos do que o utilizador "atm" (id). Mostre os atributos: nome de "atm", nome utilizador 2, nome do projeto.
```sql
MATCH (u1:User {id:"atm"})-[:COMMITED]->(p:Project)<-[:COMMITED]-(u2:User)
RETURN u1.name AS User1_Name, u2.name AS User2_Name, p.name AS Project_Name;
```

# 9. Liste todos os utilizadores que participaram com a role "Committer" em projetos em que o utilizador "atm" (id1) participou com a role "PMC".
```sql
MATCH (u1:User {id: "atm"})-[r1:COMMITED]->(p:Project)<-[r2:COMMITED]-(u2:User)
WHERE r1.role_on_project = "PMC" AND r2.role_on_project = "Committer" AND u1 <> u2
RETURN u1.name AS User1_Name, u2.name AS User2_Name, p.name AS Project_Name, r1.role_on_project AS Role1, r2.role_on_project AS Role2;
```